snemo_control_plot/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SuperNEMO control plot module</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="../css/styles.css">
                 <link rel="stylesheet" href="../css/org-pygments.css">
                 <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css">
</head>
<body onload="displayTOC()"><div id="toc"></div>
<div id="content">
<h1 class="title">SuperNEMO control plot module</h1>
<div id="table-of-contents">
<h2></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Content</a></li>
<li><a href="#sec-3">3. Pipeline general configuration</a>
<ul>
<li><a href="#sec-3-1">3.1. Module manager</a></li>
<li><a href="#sec-3-2">3.2. Service manager</a></li>
<li><a href="#sec-3-3">3.3. DLL loader</a></li>
</ul>
</li>
<li><a href="#sec-4">4. SuperNEMO &beta;&beta;0&nu; modules</a>
<ul>
<li><a href="#sec-4-1">4.1. Module declaration</a></li>
<li><a href="#sec-4-2">4.2. Histogram declarations</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Services</a>
<ul>
<li><a href="#sec-5-1">5.1. Preamble</a></li>
<li><a href="#sec-5-2">5.2. Context service</a></li>
<li><a href="#sec-5-3">5.3. Histogram service</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Running SN@ilWare processing chain</a>
<ul>
<li><a href="#sec-6-1">6.1. Tangling configuration</a></li>
<li><a href="#sec-6-2">6.2. Source code compilation</a></li>
<li><a href="#sec-6-3">6.3. Use and execute <code>snemo_control_plot</code> module</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This repository holds a SN@ilWare configuration to run SuperNEMO simulations and
to produce several "control" plots. It provides one SN@ilWare module which
automatically plot physical quantities from different data banks. For example,
it shows the distribution of the number of Geiger hits from the <code>simulated_data</code>
bank and from the <code>calibrated_data</code> bank. The purpose of this module is to have
some fundamental and key plots to check differences between software releases,
new software implementations and so on.
</p>

<p>
The current version is hosted at
<a href="https://github.com/xgarrido/snemo_simulation_modules/snemo_control_plot">https://github.com/xgarrido/snemo_simulation_modules/snemo_control_plot</a> under
<code>git</code> version control. You can clone this repository by doing
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/xgarrido/snemo_simulation_modules/snemo_control_plot snemo_control_plot
</pre>
</div>

<p>
This will create a directory <code>snemo_control_plot</code> in the working directory
containing all the source files needed to configure and to setup SN@ilWare
programs.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Content</h2>
<div class="outline-text-2" id="text-2">
<p>
The code is organised as follow :
</p>

<dl class="org-dl">
<dt><code>README.org</code></dt><dd>This file holds the pipeline configuration + the documentation
on how to use the <code>snemo_control_plot</code> module.
</dd>
<dt><code>Makefile</code></dt><dd>The <code>Makefile</code> allows to generate the pipeline configuration by
parsing and tangling this file <i>i.e.</i> <code>README.org</code> (see below).
</dd>
<dt><code>source</code></dt><dd>This directory holds the source code of the <code>snemo_control_plot</code>
module. It also has a <code>CMakeLists.txt</code> file in order to compile,
build and install all the software pieces through <code>cmake</code> rules.
</dd>
</dl>

<p>
The <code>README.org</code> file is organised using <a href="http://orgmode.org/worg/org-contrib/babel/index.html">org-babel</a> and its ability to execute
source code. It requires then a recent installation of emacs<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> which bundles
<code>org</code>. Without entering into too much details regarding <code>org-babel</code> abilities,
the basic idea is to give a "literate" way to navigate through the different
sections, each of them representing a part of the pipeline
configuration. Moreover, using <code>org</code> folding/unfolding capability, item can be
hide and the user can focus on relevant parts.
 <div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara"> At the time of writing this document, emacs version is 24.3.1 </p></div>

<p>
To export the different configuration files, you can run <code>org-babel-tangle</code>
which will tangle each code block into the given file<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> or use the associated
<code>Makefile</code>. The author recommends to use the <code>Makefile</code> since the tangling
process is asynchronous and thus, does not freeze your emacs (<code>org-babel-tangle</code>
"occupies" emacs during its execution).
 <div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara"> Emacs lisp function can be run using <code>ALT-x</code> command and typing the function name. </p></div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Pipeline general configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
SN@ilWare implements the concept of data processing pipeline. An event record
object is passed through a chain of data processing modules, each of them being
responsible for a given task. Modules and services are declared in Section
<i>Modules</i> and Section <a href="#sec-5">5</a>. For more details on running SuperNEMO simulations
and the concept behind modules/services see <a href="http://nile.hep.utexas.edu/cgi-bin/DocDB/ut-nemo/private/ShowDocument?docid=1889">these mandatory presentations</a> given
by F. Mauger.
</p>

<p>
The <code>@SNEMO_CONTROL_PLOT_DIR@</code> corresponds to the directory where configuration
files are going to be stored. This variable which varies from one installation
to the other, is automatically change when the tangle process occurs. This is
done <i>via</i> the <code>Makefile</code> which parse and replace this variable.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Module manager</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This file is the main and central piece of code for loading all modules/services
needed by <code>dpp_processing</code> binary. It provides links to module files and
service files.
</p>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Logging priority</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Module manager logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded module factory debug flag</span>
factory.debug : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Embedded module factory 'no preload' flag</span>
factory.no_preload : <span class="org-variable-name">boolean</span> = 0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Service manager configuration</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The configuration file of the embedded service manager</span>
service_manager.configuration : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@SNEMO_CONTROL_PLOT_DIR@/service_manager.conf"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Configuration files for modules</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The configuration files for modules</span>
modules.configuration_files : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@SNEMO_CONTROL_PLOT_DIR@/snemo_control_plot_module.conf"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Service manager</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Logging priority</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Service manager logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Name &amp; description</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the service manager</span>
name : <span class="org-variable-name">string</span> = <span class="org-string">"sn_service_manager"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The description of the service manager</span>
description : <span class="org-variable-name">string</span> = <span class="org-string">"A SuperNEMO service manager"</span>
</pre>
</div>
</div>
</div>
