snemo_control_plot/README.org
*** List of service files
#+BEGIN_SRC sh
  #@description The list of files that describe services
  services.configuration_files : string[1] as path = \
      "@SNEMO_CONTROL_PLOT_DIR@/services.conf"
#+END_SRC

** DLL loader
*** Code generator
:PROPERTIES:
:TANGLE: no
:RESULTS: output
:END:
This skeleton code ease the declaration of dll loader since it
receives a table list and builds the corresponding =dlls.conf= file.

#+NAME: dll_loader
#+HEADERS: :var list=""
#+BEGIN_SRC sh
  echo '#@description A sample list of setups'
  echo '#@key_label   "name"'
  echo '#@meta_label  "filename"'
  for i in $list
  do
      dll=$(echo $i | sed '/(/ s/("\|")//g')
      echo '[name="'$dll'" filename=""]'
      echo '#config The '$dll' library'
      echo 'autoload : boolean = 1'
      echo
  done
#+END_SRC
*** Libraries
:PROPERTIES:
:TANGLE: config/pipeline/dlls.conf
:END:
This part set the different libraries to be loaded at runtime. This is needed
since event data models are defined in other libraries than the one currently
named =snemo_bb0nu_studies=. The following table sets the libraries

#+CAPTION: Libraries to be used by =snemo_bb0nu_studies= modules
#+TBLNAME: dll_libraries
|---------------------|
| mctools_bio         |
| sncore_bio          |
|---------------------|

#+BEGIN_SRC sh :noweb yes
  <<dll_loader(dll_libraries[*,0])>>
#+END_SRC
* SuperNEMO \beta\beta0\nu modules

The next item holds the configuration for the SuperNEMO \beta\beta modules. The
second item is related to histogram declarations.

** Module declaration
:PROPERTIES:
:TANGLE: config/pipeline/snemo_control_plot_module.conf
:END:

Here, we just set up the module declaration. The module name to be used when
processing a file is =scp_module=.

*** File preamble
#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC
*** Declaration & description
#+BEGIN_SRC sh
  [name="scp_module" type="analysis::snemo_control_plot_module"]

  #@description A SuperNEMO module to plot key quantities from data banks
#+END_SRC

*** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

*** Histogram service label
Set the same histogram service label as defined [[Histogram service][here]]
#+BEGIN_SRC sh
  #@description The Histogram Service label
  Histo_label : string = "Histo"
#+END_SRC

** Histogram declarations
:PROPERTIES:
:TANGLE: config/pipeline/histogram_templates.conf
:END:

The histogram declarations /i.e./ name, boundaries, binning... are set in this
section which is organized by data bank related plots. There are two kinds of
histograms:
- /unique/ histogram, dedicated to one task and used only one time,
- /template/ histogram which may be used by several data bank.
For example, to plot the distribution of the number of Geiger hits which can be
done for =simulated_data= and =calibrated_data= banks, we use *one* histogram
template that define boundaries, binning, axis titles... The /template/
histograms all belong to the =__template= group.

*** Mandatory preamble
#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

*** Simulated data bank histograms
**** Number of Geiger hits
#+BEGIN_SRC sh
  [name="SD::ngghits" type="mygsl::histogram_1d"]
  #@config The histogram of the number of MC Geiger hits

  #@description The title of the histogram (optional)
  title : string = "Number of MC Geiger hits"

  #@description The group of the histogram (optional)
  group : string = "SD::histos"

  #@description The build mode (default : "regular", "table", "mimic");
  mode : string = "regular"

  #@description The linear mode (default)
  linear : boolean = 1

  #@description The number of bins
  number_of_bins : integer = 50

  #@description The lower bound of the histogram
  min : real = -0.5

  #@description The upper bound of the histogram
  max : real = 99.5

  #@description The X axis label
  display.xaxis.label : string = "Ngg"

  #@description The Y axis label
  display.yaxis.label : string = "Counts"
#+END_SRC

