snemo_control_plot/README.html
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> List of service files</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of files that describe services</span>
services.configuration_files : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@SNEMO_CONTROL_PLOT_DIR@/services.conf"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> DLL loader</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Code generator</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
This skeleton code ease the declaration of dll loader since it
receives a table list and builds the corresponding <code>dlls.conf</code> file.
</p>

<div class="org-src-container">

<pre class="src src-sh" id="dll_loader"><span class="org-builtin">echo</span> <span class="org-string">'#@description A sample list of setups'</span>
<span class="org-builtin">echo</span> <span class="org-string">'#@key_label   "name"'</span>
<span class="org-builtin">echo</span> <span class="org-string">'#@meta_label  "filename"'</span>
<span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $<span class="org-variable-name">list</span>
<span class="org-keyword">do</span>
    <span class="org-variable-name">dll</span>=$(<span class="org-builtin">echo</span> $<span class="org-variable-name">i</span> | sed <span class="org-string">'/(/ s/("\|")//g'</span>)
    <span class="org-builtin">echo</span> <span class="org-string">'[name="'</span>$<span class="org-variable-name">dll</span><span class="org-string">'" filename=""]'</span>
    <span class="org-builtin">echo</span> <span class="org-string">'#config The '</span>$<span class="org-variable-name">dll</span><span class="org-string">' library'</span>
    <span class="org-builtin">echo</span> <span class="org-string">'autoload : boolean = 1'</span>
    <span class="org-builtin">echo</span>
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Libraries</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
This part set the different libraries to be loaded at runtime. This is needed
since event data models are defined in other libraries than the one currently
named <code>snemo_bb0nu_studies</code>. The following table sets the libraries
</p>

<table id="dll_libraries" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="void">
<caption class="t-above"><span class="table-number">Table 1:</span> Libraries to be used by <code>snemo_bb0nu_studies</code> modules</caption>

<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">mctools_bio</td>
</tr>

<tr>
<td class="left">sncore_bio</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "filename"</span>
[<span class="org-variable-name">name</span>=<span class="org-string">"mctools_bio"</span> <span class="org-variable-name">filename</span>=<span class="org-string">""</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">config The mctools_bio library</span>
<span class="org-builtin">autoload</span> : <span class="org-variable-name">boolean</span> = 1

[<span class="org-variable-name">name</span>=<span class="org-string">"sncore_bio"</span> <span class="org-variable-name">filename</span>=<span class="org-string">""</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">config The sncore_bio library</span>
<span class="org-builtin">autoload</span> : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SuperNEMO &beta;&beta;0&nu; modules</h2>
<div class="outline-text-2" id="text-4">
<p>
The next item holds the configuration for the SuperNEMO &beta;&beta; modules. The
second item is related to histogram declarations.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Module declaration</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Here, we just set up the module declaration. The module name to be used when
processing a file is <code>scp_module</code>.
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> File preamble</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Declaration &amp; description</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"scp_module"</span> <span class="org-variable-name">type</span>=<span class="org-string">"analysis::snemo_control_plot_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description A SuperNEMO module to plot key quantities from data banks</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Logging priority</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> Histogram service label</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Set the same histogram service label as defined <a href="#sec-5-3">here</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The Histogram Service label</span>
Histo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Histo"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Histogram declarations</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The histogram declarations <i>i.e.</i> name, boundaries, binning&#x2026; are set in this
section which is organized by data bank related plots. There are two kinds of
histograms:
</p>
<ul class="org-ul">
<li><i>unique</i> histogram, dedicated to one task and used only one time,
</li>
<li><i>template</i> histogram which may be used by several data bank.
</li>
</ul>
<p>
For example, to plot the distribution of the number of Geiger hits which can be
done for <code>simulated_data</code> and <code>calibrated_data</code> banks, we use <b>one</b> histogram
template that define boundaries, binning, axis titles&#x2026; The <i>template</i>
histograms all belong to the <code>__template</code> group.
</p>
</div>

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Mandatory preamble</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Simulated data bank histograms</h4>
<div class="outline-text-4" id="text-4-2-2">
</div><ul class="org-ul"><li>Number of Geiger hits<br  /><div class="outline-text-5" id="text-4-2-2-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"SD::ngghits"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the number of MC Geiger hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">"Number of MC Geiger hits"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"SD::histos"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 50

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = -0.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 99.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Ngg"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Counts"</span>
</pre>
</div>
</div>
</li>
