snemo_control_plot/README.org
**** Number of calorimeter hits
#+BEGIN_SRC sh
  [name="SD::ncalohits" type="mygsl::histogram_1d"]
  #@config The histogram of the number of MC calo hits

  #@description The title of the histogram (optional)
  title : string = "Number of MC calorimeter hits"

  #@description The group of the histogram (optional)
  group : string = "SD::histos"

  #@description The build mode (default : "regular", "table", "mimic");
  mode : string = "regular"

  #@description The linear mode (default)
  linear : boolean = 1

  #@description The number of bins
  number_of_bins : integer = 10

  #@description The lower bound of the histogram
  min : real = -0.5

  #@description The upper bound of the histogram
  max : real = 9.5

  #@description The X axis label
  display.xaxis.label : string = "Ncalo"

  #@description The Y axis label
  display.yaxis.label : string = "Counts"

  #@description Display style
  display.style : string = "solid"

  #@description Display color
  display.color : string = "blue"
#+END_SRC

*** Calibrated data bank histograms
**** Number of calibrated tracker hits
#+BEGIN_SRC sh
  [name="CD::ngghits" type="mygsl::histogram_1d"]
  #@config The histogram of the number of calibrated tracker hits

  #@description The title of the histogram (optional)
  title : string = "Number of calibrated tracker hits"

  #@description The group of the histogram (optional)
  group : string = "CD::histos"

  #@description The build mode (default : "regular", "table", "mimic");
  mode : string = "regular"

  #@description The linear mode (default)
  linear : boolean = 1

  #@description The number of bins
  number_of_bins : integer = 25

  #@description The lower bound of the histogram
  min : real = -0.5

  #@description The upper bound of the histogram
  max : real = 99.5

  #@description The X axis label
  display.xaxis.label : string = "N_\text{calib.}(tracker)"

  #@description The Y axis label
  display.yaxis.label : string = "Counts"
#+END_SRC

**** Number of calibrated calorimeter hits
#+BEGIN_SRC sh
  [name="CD::ncalohits" type="mygsl::histogram_1d"]
  #@config The histogram of the number of calibrated calorimeter hits

  #@description The title of the histogram (optional)
  title : string = "Number of calibrated calorimeter hits"

  #@description The group of the histogram (optional)
  group : string = "CD::histos"

  #@description The build mode (default : "regular", "table", "mimic");
  mode : string = "regular"

  #@description The linear mode (default)
  linear : boolean = 1

  #@description The number of bins
  number_of_bins : integer = 10

  #@description The lower bound of the histogram
  min : real = -0.5

  #@description The upper bound of the histogram
  max : real = 9.5

  #@description The X axis label
  display.xaxis.label : string = "N_\text{calib.}(calorimeter)"

  #@description The Y axis label
  display.yaxis.label : string = "Counts"

  #@description Display style
  display.style : string = "solid"

  #@description Display color
  display.color : string = "blue"
#+END_SRC

*** Tracker clustering data bank histograms
**** Number of clusters
#+BEGIN_SRC sh
  [name="TCD::nclusters" type="mygsl::histogram_1d"]
  #@config The histogram of the number of tracker clusters

  #@description The title of the histogram (optional)
  title : string = "Number of tracker clusters"

  #@description The group of the histogram (optional)
  group : string = "TCD::histos"

  #@description The build mode (default : "regular", "table", "mimic");
  mode : string = "regular"

  #@description The linear mode (default)
  linear : boolean = 1

  #@description The number of bins
  number_of_bins : integer = 10

  #@description The lower bound of the histogram
  min : real = -0.5

  #@description The upper bound of the histogram
  max : real = 9.5

  #@description The X axis label
  display.xaxis.label : string = "N_\text{cluster}"

  #@description The Y axis label
  display.yaxis.label : string = "Counts"
#+END_SRC

* Services
:PROPERTIES:
:TANGLE: config/pipeline/services.conf
:END:

A service generally hosts a specific resource that can be shared by many other
software components, including other services or data processing modules (see
[[https://nemo.lpc-caen.in2p3.fr/wiki/SNSW_SNailWare_FAQ#Whatisaservice][SN@ilWare FAQ]]).

** Preamble

#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

