snemo_control_plot/README.html

<li>Number of calorimeter hits<br  /><div class="outline-text-5" id="text-4-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"SD::ncalohits"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the number of MC calo hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">"Number of MC calorimeter hits"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"SD::histos"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 10

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = -0.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 9.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Ncalo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Counts"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Display style</span>
display.style : <span class="org-variable-name">string</span> = <span class="org-string">"solid"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Display color</span>
display.color : <span class="org-variable-name">string</span> = <span class="org-string">"blue"</span>
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> Calibrated data bank histograms</h4>
<div class="outline-text-4" id="text-4-2-3">
</div><ul class="org-ul"><li>Number of calibrated tracker hits<br  /><div class="outline-text-5" id="text-4-2-3-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"CD::ngghits"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the number of calibrated tracker hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">"Number of calibrated tracker hits"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"CD::histos"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 25

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = -0.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 99.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"N_\text{calib.}(tracker)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Counts"</span>
</pre>
</div>
</div>
</li>

<li>Number of calibrated calorimeter hits<br  /><div class="outline-text-5" id="text-4-2-3-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"CD::ncalohits"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the number of calibrated calorimeter hits</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">"Number of calibrated calorimeter hits"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"CD::histos"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 10

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = -0.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 9.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"N_\text{calib.}(calorimeter)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Counts"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Display style</span>
display.style : <span class="org-variable-name">string</span> = <span class="org-string">"solid"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Display color</span>
display.color : <span class="org-variable-name">string</span> = <span class="org-string">"blue"</span>
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Tracker clustering data bank histograms</h4>
<div class="outline-text-4" id="text-4-2-4">
</div><ul class="org-ul"><li>Number of clusters<br  /><div class="outline-text-5" id="text-4-2-4-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"TCD::nclusters"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the number of tracker clusters</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">"Number of tracker clusters"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"TCD::histos"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 10

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = -0.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 9.5

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"N_\text{cluster}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"Counts"</span>
</pre>
</div>
</div>
</li></ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Services</h2>
<div class="outline-text-2" id="text-5">
<p>
A service generally hosts a specific resource that can be shared by many other
software components, including other services or data processing modules (see
<a href="https://nemo.lpc-caen.in2p3.fr/wiki/SNSW_SNailWare_FAQ#Whatisaservice">SN@ilWare FAQ</a>).
</p>
</div>
