snemo_control_plot/README.html

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Preamble</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Context service</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Ctx"</span> <span class="org-variable-name">type</span>=<span class="org-string">"dpp::context_service"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description File from which the context is to be loaded at program start</span>
load.file : string as <span class="org-variable-name">path</span>  = <span class="org-string">"/tmp/${USER}/snemo.d/snemo_context.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description File to store the context at program termination</span>
store.file : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo.d/snemo_context_end.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to backup the former context load file</span>
backup.file : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo.d/snemo_context_bak.conf"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Histogram service</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The histogram service provides an esay way to handle histogram plot from
different modules (mainly plot modules). It provides a service where 1D or 2D
histograms can be added to a histogram dictionnary.
</p>

<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"Histo"</span> <span class="org-variable-name">type</span>=<span class="org-string">"dpp::histogram_service"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The description string of the embedded pool of histograms</span>
pool.description : <span class="org-variable-name">string</span> = <span class="org-string">"SuperNEMO histograms"</span>
</pre>
</div>

<p>
Embedded histograms are declared into a dedicated file defines in
<a href="snanalysis_manager.html">snanalysis_manager.org</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The main configuration file for the embedded histogram manager</span>
pool.histo.setups : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@SNEMO_CONTROL_PLOT_DIR@/histogram_templates.conf"</span>
</pre>
</div>

<p>
Finally, all histograms created can be stored inside ROOT files or XML archives.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The ouput file where to store the histograms</span>
output_files : string[1] as <span class="org-variable-name">path</span> =                        <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"/tmp/${USER}/snemo.d/snemo_control_plot_histos.root"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"/tmp/${USER}/snemo.d/snemo_control_plot_histos.xml"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Running SN@ilWare processing chain</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Tangling configuration</h3>
<div class="outline-text-3" id="text-6-1">
<p>
First, you need to tangle this file. As explained in the <a href="#sec-2">Content</a> section, you
may use the dedicated <code>Makefile</code> to generate the pipeline configuration. Just
run <code>make</code> within this working directory.
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Source code compilation</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Second, you need to compile the <code>snemo_control_plot</code> module files. The build
system used is <code>cmake</code> and a <code>CMakeLists.txt</code> file is provided to correctly
setup the dependences. Nevertheless, this implies that you have already and
correctly installed <a href="https://nemo.lpc-caen.in2p3.fr/wiki/Software/Cadfael">Cadfael</a>, <a href="https://nemo.lpc-caen.in2p3.fr/wiki/Software/Bayeux">Bayeux</a> and Falaise. Then, you can configure, build
and install the <code>snemo_control_plot</code> module by doing
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir {build,install} &amp;&amp; <span class="org-builtin">cd</span> build
cmake                                               <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_PREFIX_PATH=<span class="org-string">"&lt;path to Falaise install&gt;"</span> <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_INSTALL_PREFIX=../install               <span class="org-sh-escaped-newline">\</span>
    ../source
make install
<span class="org-builtin">cd</span> ..
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Use and execute <code>snemo_control_plot</code> module</h3>
<div class="outline-text-3" id="text-6-3">
<p>
After a successful build, you will get an <code>install</code> directory holding the
<code>libsnemo_control_plot.so</code> file. Assuming you are under <code>bash</code> shell, you will
need to add it to your <code>LD_LIBRARY_PATH</code> by doing
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">LD_LIBRARY_PATH</span>=${<span class="org-variable-name">PWD</span>}/install/lib:${<span class="org-variable-name">LD_LIBRARY_PATH</span>}
</pre>
</div>

<p>
Running processing pipeline is done by the <code>dpp_processing</code> program provided by
<code>dpp</code> library. Its call is pretty simple and only implies to have a module
manager file and the name of the module to be run <i>i.e.</i>
<code>scp_module</code>. Nevertheless, you need to load the dynamically load the
library(ies) which holds the needed modules.
</p>

<div class="org-src-container">

<pre class="src src-sh">dpp_processing                                                       <span class="org-sh-escaped-newline">\</span>
    --module-manager-config $<span class="org-variable-name">PWD</span>/config/pipeline/module_manager.conf <span class="org-sh-escaped-newline">\</span>
    --module scp_module                                              <span class="org-sh-escaped-newline">\</span>
    --load-dll snemo_control_plot                                    <span class="org-sh-escaped-newline">\</span>
    --load-dll &lt;library&gt;_bio                                         <span class="org-sh-escaped-newline">\</span>
    --input-file &lt;path to a data record&gt;
</pre>
</div>

<p>
<code>&lt;library&gt;_bio</code> represents libraries which holds event data models such as
<code>mctools_bio</code> and <code>sncore_bio</code>. Regarding the input data file and its content,
you will need to load both to be able to retrieve <code>simulated_data</code> bank
(<code>mctools_bio</code>) or specific SuperNEMO banks (<code>sncore_bio</code>).
</p>

<p>
It will run the <code>scp_module</code> over the input file<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> and it will generate a ROOT
file containing several histograms. This file is located by default, in
<code>/tmp/${USER}/snemo.d</code> directory under the <code>snemo_control_plot_histos.root</code>
name. You can change the output directory and output file name in <a href="#sec-5-3">this section</a>.
 <div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara"> here we assume that you already have generated a data record. The <code>snemo_control_plot</code> only generate the plot and does not neither simulation nor reconstruction. </p></div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes"> </h2>
<div id="text-footnotes">





</div>
</div></div>
<div id="postamble" class="status">
File under git version control - commit <a href="https://github.com/xgarrido/emacs-starter-kit/commit/418c55adf6993acb788e0f08bcf6987b3aff86b6">418c55a</a> - 2014-04-19
</div>
</body>
</html>
